app/views/pages/home.html.erb


  <% @current_user.mixtapes.each do |m| %>
---
SELECT "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."user_id" = $1  [["user_id", 80]]