app/controllers/mixtapes_controller.rb

INSERT INTO "mixtapes" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Car Make Outs"], ["created_at", "2020-10-19 23:03:50.236713"], ["updated_at", "2020-10-19 23:03:50.236713"]]
---
  def create
    # create the mixtape
    mixtape = Mixtape.create mixtape_params

SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]
---
  def show
    @mixtape = Mixtape.find params[:id]

SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
---
  def edit
    @mixtape = Mixtape.find params[:id]